---
kind: property
id: P:Autodesk.Revit.DB.DefinitionGroups.Size
source: html/c967737a-bbde-c6bb-bc00-a33b5d869bc3.htm
---
# Autodesk.Revit.DB.DefinitionGroups.Size Property

The number of definition groups in the collection.

## Syntax (C#)
```csharp
public int Size { get; }
```